"""
02-运算符 - 练习2
练习目标：掌握比较运算符和逻辑运算符
"""

# 1. 比较运算
a = 5
b = 10

# 判断并打印结果：
# a 是否大于 b
# a 是否小于等于 b
# a 是否等于 b
# a 是否不等于 b

# 请在这里写下你的代码
print(a > b)
print(a <= b)
print(a == b)
print(a != b)


# 2. 逻辑运算练习
age = 28
height = 175

# 判断：年龄大于等于18 并且 身高大于170
result1 =  (age >= 18) and (height > 170) # 请在这里补充代码
print(f"年龄大于等于18 并且 身高大于170：{result1}")

# 判断：年龄小于18 或者 身高大于等于180
result2 = (age < 18) or (height >= 180) # 请在这里补充代码
print(f"年龄小于18 或者 身高大于等于180：{result2}")

# 3. 判断年份是否为闰年
# 闰年规则：
# 能被4整除但不能被100整除，或者能被400整除
year = 2024

# 请完成判断，结果保存到is_leap变量中
is_leap = (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0) # 请在这里补充代码

print(f"{year}年是否是闰年：{is_leap}")
